{
    "id": "gaya",
    "slug": "gaya",
    "title": "Gaya: City of Ancestors",
    "hero_image": "gaya-hero-placeholder.jpg",
    "gallery_images": [
        "gaya-vishnupad-temple.jpg",
        "gaya-pind-daan.jpg",
        "gaya-phalgu-river.jpg",
        "gaya-mangla-gauri.jpg"
    ],
    "short_description": "Perform Pind Daan rituals for ancestors at the sacred Vishnupad Temple on the Phalgu river.",
    "long_description": "Gaya, located 100km from Patna in Bihar, is one of the most significant pilgrimage sites for Pind Daan (offering to ancestors). While Bodh Gaya (13km away) is about Enlightenment, Gaya is about debt—paying the debt to one's lineage (Pitru Rina). \n\nThe central shrine is the Vishnupad Temple, built of black basalt, which houses a 40cm long footprint of Lord Vishnu stamped into a rock. Legend says Vishnu killed the demon Gayasur here by placing his foot on his chest. \n\nThe rituals are performed on the banks of the Phalgu River. The river is unique because it flows underground (due to a curse by Goddess Sita); pilgrims often have to dig into the sandy riverbed to find water for the rituals. Gaya is also a Shakti Peeth (Mangla Gauri), making it powerful for Goddess worship as well.",
    "spiritual_significance": "The supreme place for Shradh/Pind Daan. It is believed that offering Pind here grants immediate salvation to ancestors. Mangla Gauri is one of the 18 Maha Shakti Peethas.",
    "major_temples_and_sites": [
        {
            "name": "Vishnupad Temple",
            "description": "The main temple built by Queen Ahilyabai Holkar. It houses Vishnu's footprint (Dharmasila)."
        },
        {
            "name": "Phalgu River",
            "description": "The 'hidden' river. Sacred for funeral rites."
        },
        {
            "name": "Mangla Gauri Temple",
            "description": "A hilltop temple dedicated to Shakti (Breast of Sati fell here). Requires climbing steps."
        },
        {
            "name": "Akshayvat",
            "description": "The undying Banyan tree where the final Pind Daan is performed. It is believed to be eternal."
        },
        {
            "name": "Pretshila Hill",
            "description": "A hill dedicated to Yama, where rituals are done for those who died unnatural deaths."
        }
    ],
    "rituals_and_experiences": [
        "Perform Pind Daan for ancestors (requires a priest).",
        "Darshan of Vishnu Pad.",
        "Visit Mangla Gauri temple deeply in the evening.",
        "Visit the Dungeshwari Cave (where Buddha meditated) nearby.",
        "Tie a red thread at Akshayvat for wish fulfillment."
    ],
    "highlights": [
        "The unique underground river.",
        "The massive footprint of Vishnu.",
        "The ancient atmosphere of the narrow lanes.",
        "Proximity to Bodh Gaya.",
        "The specialized 'Gayawal Pandas' (priests)."
    ],
    "local_guides_available": true,
    "best_months": "September to March. Pitru Paksha (Sept/Oct) is extremely crowded.",
    "how_to_reach": "By Air: Gaya International Airport. By Train: Gaya Junction. By Road: Connects to Patna and Varanasi.",
    "stay_recommendations": "Luxury: Hotels in Bodh Gaya (better options). Spiritual: Bharat Sevashram Sangha. Budget: Hotels near station.",
    "safety_tips": "Priests can be aggressive with fees; negotiate or fix rates beforehand via a trusted contact. The riverbed can be dirty; watch your step.",
    "sample_itinerary": "Day 1: Arrive. Visit Vishnupad Temple. Perform Pind Daan (takes 2-3 hours). Visit Mangla Gauri. Drive to Bodh Gaya for stay.",
    "tags": [
        "Ancestors",
        "Vishnu",
        "Rituals",
        "History",
        "Bihar"
    ],
    "is_bookable": true
}