{
    "id": "chamunda-devi",
    "slug": "chamunda-devi",
    "title": "Chamunda Devi: Shakti of the Hills",
    "hero_image": "chamunda-hero-placeholder.jpg",
    "gallery_images": [
        "chamunda-devi-temple.jpg",
        "chamunda-river.jpg",
        "chamunda-himachal-view.jpg",
        "chamunda-arti.jpg"
    ],
    "short_description": "A powerful Shakti Peeth in Himachal Pradesh dedicated to Goddess Chamunda.",
    "long_description": "Chamunda Devi Temple, located 10km from Palampur in Himachal Pradesh, is a shrine of immense power and serene beauty. It is dedicated to Chamunda, the wrathful form of Goddess Durga who slew the demons Chanda and Munda. \n\nThe temple is situated on the banks of the Baner River, with the majestic Dhauladhar mountain range providing a dramatic backdrop. Unlike many other Devi temples, the idol here is often covered in a red cloth, and the main deity is worshipped in the form of a Pindi (stone) and also as the wrathful Goddess. \n\nThe complex also houses a cave-like shrine where a Shiva Lingam is placed under a boulder, depicting the legend of Nandikeshwar. The sound of the rushing river and the pine forests create a meditative atmosphere, contrasting with the fierce nature of the deity.",
    "spiritual_significance": "One of the 7 mother goddesses (Sapta Matrikas). It is a Shakti Peeth. The goddess is considered the destroyer of evil and protector of the righteous.",
    "major_temples_and_sites": [
        {
            "name": "Chamunda Devi Temple",
            "description": "The main shrine with a sloping slate roof typical of Himachali architecture."
        },
        {
            "name": "Nandikeshwar Dham",
            "description": "A Shiva shrine within the complex."
        },
        {
            "name": "Baner River Ghat",
            "description": "The river flowing behind the temple; devotees can sit on the rocks and meditate."
        },
        {
            "name": "Baijnath Temple",
            "description": "An ancient 13th-century Shiva temple located 16km away, known for its exquisite stone carvings."
        },
        {
            "name": "Dharamshala/McLeod Ganj",
            "description": "Located about 25km away, the Dalai Lama's residence."
        }
    ],
    "rituals_and_experiences": [
        "Darshan of the Goddess.",
        "Perform a Havan/Yajna (common here).",
        "Meditate by the Baner River.",
        "Visit the Ayurvedic dispensary in the complex.",
        "Enjoy the panoramic views of the Dhauladhar range."
    ],
    "highlights": [
        "The stunning mountain backdrop.",
        "The sound of the river accompanying prayers.",
        "The 700-year-old temple architecture.",
        "The peaceful, less crowded vibe.",
        "Proximity to Palampur tea gardens."
    ],
    "local_guides_available": true,
    "best_months": "March to June and September to November. Navratri is very festive.",
    "how_to_reach": "By Air: Gaggal Airport (Kangra) is 25km away. By Road: Well connected to Dharamshala and Palampur.",
    "stay_recommendations": "Luxury: WelcomHeritage Taragarh Palace (Palampur). Spiritual: Chamunda Devi Temple Guest House. Budget: Hotels in Yol Cantt.",
    "safety_tips": "Do not venture too deep into the river during monsoon as flash floods occur. Monkeys are present.",
    "sample_itinerary": "Day 1: Drive from Dharamshala to Chamunda Devi. Darshan. Meditate by river. Lunch. Visit Palampur Tea Gardens. Return.",
    "tags": [
        "Goddess",
        "Himalayas",
        "River",
        "Shakti",
        "Nature"
    ],
    "is_bookable": true
}