{
    "id": "shirdi",
    "slug": "shirdi",
    "title": "Shirdi: Land of Sai",
    "hero_image": "shirdi-hero-placeholder.jpg",
    "gallery_images": [
        "shirdi-sai-temple.jpg",
        "shirdi-dwarkamai.jpg",
        "shirdi-samadhi.jpg",
        "shirdi-neem-tree.jpg"
    ],
    "short_description": "Find peace at the Samadhi Mandir of the saint who taught 'Sabka Malik Ek' (One God governs all).",
    "long_description": "Shirdi is a small town in Maharashtra that has become one of India's top pilgrimage destinations, dedicated to Sai Baba, a saint who lived here in the late 19th and early 20th centuries. Sai Baba is revered by both Hindus and Muslims; he lived in a mosque (Dwarkamai) but is worshipped with Hindu rituals. His core teaching was 'Shraddha' (Faith) and 'Saburi' (Patience), alongside 'Sabka Malik Ek' (God is One).\n\nThe atmosphere in Shirdi is one of intense devotion and equality. The Samadhi Mandir, where his mortal remains are interred, is the focal point. Pilgrims queue for hours to get a glimpse of the lifelike marble statue of Sai Baba. Key spots include Dwarkamai (where the sacred fire/Dhuni lit by him still burns) and Chavadi (where he slept every alternate night). The Prasadalaya here is massive, serving thousands of free meals daily.",
    "spiritual_significance": "The holistic center of Sai Baba's devotees. The Dhuni (sacred fire) ash, known as 'Udi', is believed to have miraculous healing powers. It is a place specifically for those seeking miracles, healing, and peace.",
    "major_temples_and_sites": [
        {
            "name": "Samadhi Mandir",
            "description": "The main temple housing Sai Baba's tomb and the famous Italian marble statue."
        },
        {
            "name": "Dwarkamai",
            "description": "The dilapidated mosque where Sai Baba lived for 60 years. The Dhuni (fire) here has been burning continuously for over a century."
        },
        {
            "name": "Gurusthan",
            "description": "The spot under a Neem tree where Sai Baba was first seen as a young boy."
        },
        {
            "name": "Chavadi",
            "description": "A place where Baba used to sleep. It commemorates the Thursday processions."
        },
        {
            "name": "Dixit Wada Museum",
            "description": "Displays personal items used by Sai Baba like his robe, pipe, and cooking pots."
        }
    ],
    "rituals_and_experiences": [
        "Darshan at Samadhi Mandir (Kakad Aarti at 4:30 AM is special).",
        "Collect 'Udi' (sacred ash) from Dwarkamai.",
        "Do 'Pradakshina' around the Gurusthan Neem Tree.",
        "Eat at the Prasadalaya (Mega Kitchen).",
        "Attend the Thursday Palki procession (if visiting on Thursday)."
    ],
    "highlights": [
        "The palpable faith of the devotees.",
        "The continuous fire at Dwarkamai.",
        "The historic vibe of the old village.",
        "The miraculous stories of Sai Baba.",
        "The disciplined crowd management."
    ],
    "local_guides_available": true,
    "best_months": "Year-round. Winters (Oct-Mar) are pleasant. Thursdays and festivals (Guru Purnima) are crowded.",
    "how_to_reach": "By Air: Shirdi Airport (SAG) connects to major metros. By Train: Sainagar Shirdi Station. By Road: 4-5 hours from Mumbai/Pune.",
    "stay_recommendations": "Luxury: St Laurn, Sun-n-Sand. Spiritual: Sai Ashram (thousands of rooms, very cheap). Budget: Hotels near temple gate.",
    "safety_tips": "Beware of touts selling 'VIP Darshan' tickets outside; only buy from official counters. Keep footwear at designated stands.",
    "sample_itinerary": "Day 1: Arrive. Check in. Darshan at Samadhi Mandir. Visit Dwarkamai, Gurusthan, and Chavadi. Dinner at Prasadalaya.\nDay 2: Morning Kakad Aarti (optional). Visit Museum. Buy souvenirs. Depart.",
    "tags": [
        "Saint",
        "Faith",
        "Miracles",
        "Modern",
        "Unity"
    ],
    "is_bookable": true
}