{
    "id": "mathura",
    "slug": "mathura",
    "title": "Mathura: Krishna Janmabhoomi",
    "hero_image": "mathura-hero-placeholder.jpg",
    "gallery_images": [
        "mathura-janmabhoomi.jpg",
        "mathura-vishram-ghat.jpg",
        "mathura-museum.jpg",
        "mathura-holi.jpg"
    ],
    "short_description": "The sacred birthplace of Lord Krishna, alive with temples, ghats, and devotion.",
    "long_description": "Mathura in Uttar Pradesh is the nucleus of Braj Bhoomi. It is the place where Lord Krishna was born in a prison cell to Devaki and Vasudeva. Today, the Krishna Janmabhoomi Temple complex stands over the believed site of the prison, a massive spiritual center that resonates with the chant of 'Hare Krishna'.\n\nMathura is one of the Sapta Puris and situated on the banks of the Yamuna River. The city is a sensory explosion—narrow lanes smelling of pedas (milk sweet) and kachoris, 25 ghats lining the river, and bells ringing incessantly. Vishram Ghat is the most sacred spot, where Krishna is believed to have rested after killing the tyrant Kansa. The daily Yamuna Aarti here is a simpler but soulful version of the one in Varanasi.",
    "spiritual_significance": "Birthplace of Krishna (Janmabhoomi). One of the seven holy cities (Mokshapuri). Taking a dip in the Yamuna at Vishram Ghat is purifying.",
    "major_temples_and_sites": [
        {
            "name": "Shri Krishna Janmabhoomi",
            "description": "The main temple complex housing the prison cell (Garbh Griha) and a grand Bhagavat Bhavan."
        },
        {
            "name": "Dwarkadhish Temple",
            "description": "Built in 1814, famous for its intricate architecture and Jhulan Yatra (swing festival)."
        },
        {
            "name": "Vishram Ghat",
            "description": "The central ghat for holy dips and Aarti. Boat rides start here."
        },
        {
            "name": "Mathura Museum",
            "description": "Houses world-class sculptures from the Kushana and Gupta periods (Mathura School of Art)."
        },
        {
            "name": "Birla Mandir (Gita Mandir)",
            "description": "A beautiful temple on the outskirts with the entire Gita inscribed on a pillar."
        }
    ],
    "rituals_and_experiences": [
        "Darshan at the Janmabhoomi prison cell.",
        "Boat ride on the Yamuna.",
        "Attend evening Yamuna Aarti at Vishram Ghat.",
        "Eat 'Mathura ke Pede' (famous sweet).",
        "Celebrate Holi (Lathmar Holi) if visiting in March."
    ],
    "highlights": [
        "The emotional resonance of the birthplace.",
        "The vibrant Holi celebrations (world famous).",
        "The artistic treasures in the Museum.",
        "The evening Ghat ambience.",
        "The omnipresent love for 'Kanha' (Krishna)."
    ],
    "local_guides_available": true,
    "best_months": "October to March. Janmashtami (Aug) and Holi (March) are peak.",
    "how_to_reach": "By Air: Agra Airport (50km). By Train: Mathura Junction (major hub). By Road: Yamuna Expressway from Delhi (2.5 hours).",
    "stay_recommendations": "Luxury: Nidhivan Sarovar Portico (in Vrindavan). Spiritual: Birla Guest House. Budget: Hotels near Janmabhoomi.",
    "safety_tips": "Monkeys are notorious for snatching glasses and phones; keep them hidden. Janmabhoomi security is very strict (no phones/bags).",
    "sample_itinerary": "Day 1: Arrive. Visit Janmabhoomi. Lunch. Visit Museum. Evening boat ride and Aarti at Vishram Ghat.\nDay 2: Morning visit to Dwarkadhish. Proceed to Vrindavan (10km away).",
    "tags": [
        "Krishna",
        "History",
        "River",
        "Holi",
        "Art"
    ],
    "is_bookable": true
}