{
    "id": "kedarnath",
    "slug": "kedarnath",
    "title": "Kedarnath: Shiva's Himalayan Abode",
    "hero_image": "kedarnath-hero-placeholder.jpg",
    "gallery_images": [
        "kedarnath-temple-snow.jpg",
        "kedarnath-trek.jpg",
        "kedarnath-shiva-statue.jpg",
        "kedarnath-valley.jpg"
    ],
    "short_description": "A sacred trekking pilgrimage to one of the 12 Jyotirlingas amidst majestic snow peaks.",
    "long_description": "Kedarnath is not merely a temple; it is a test of faith and endurance. Standing at 3,583 meters (11,755 ft) amidst the snow-clad Garhwal Himalayas, it is one of the Char Dham sites and home to one of the 12 Jyotirlingas of Lord Shiva. The temple, built of massive stone slabs, stands stoically against the backdrop of the Kedar Dome peak, surviving glaciers and floods, a testament to divinity and resilience.\n\nThe journey to Kedarnath is as significant as the destination. A steep 16km trek from Gaurikund takes pilgrims through breathtaking alpine landscapes, waterfalls, and thin air. The chant of 'Har Har Mahadev' echoes off the mountains as thousands of devotees trudge upward. When the temple finally emerges from the mist, the exhaustion vanishes, replaced by an overwhelming sense of awe. Legend says the Pandavas built this temple to seek Shiva's forgiveness after the Mahabharata war. Shiva, eluding them, took the form of a bull and dove into the ground here, leaving his hump on the surface—which is worshipped as the conical lingam inside.\n\nKedarnath is raw, powerful, and utterly majestic. It disconnects you from the modern world and forces you to confront the grandeur of nature and the silence of the divine.",
    "spiritual_significance": "One of the 12 Jyotirlingas and a major site in the Panch Kedar pilgrimage. It represents the 'hump' of the bull form Shiva assumed. Visiting here is believed to grant liberation from the cycle of karma. It is open only for 6 months a year (Akshaya Tritiya to Kartik Purnima).",
    "major_temples_and_sites": [
        {
            "name": "Kedarnath Temple",
            "description": "The main shrine, believed to be over 1,000 years old (originally built by Adi Shankaracharya). It houses the irregular conical lingam."
        },
        {
            "name": "Bhairav Nath Temple",
            "description": "Located slightly higher up the hill. Bhairav Nath is the guardian deity (Kshetrapal) who protects the valley when the temple is closed in winter."
        },
        {
            "name": "Gaurikund",
            "description": "The base camp for the trek. It has hot springs and a temple dedicated to Goddess Gauri (Parvati)."
        },
        {
            "name": "Gandhi Sarovar (Chorabari Tal)",
            "description": "A glacial lake located about 3km from the temple. Legend says Yudhishthira, the Pandava, began his ascent to heaven from near here."
        },
        {
            "name": "Rudra Meditation Cave",
            "description": "A modern underground meditation cave near the temple, made famous after PM Modi managed a retreat there."
        }
    ],
    "rituals_and_experiences": [
        "Perform the arduous 16km trek (or take a pony/palki/helicopter).",
        "Attend the Morning Abhishek or Evening Aarti at the temple.",
        "Meditate near the Mandakini river with views of the snow peaks.",
        "Visit Bhairav Nath temple for panoramic views of the Kedar valley.",
        "Take a dip in the hot springs at Gaurikund before starting the trek."
    ],
    "highlights": [
        "The first view of the temple against the snowy Sumeru Parbat.",
        "The collective energy of pilgrims chanting 'Om Namah Shivaya'.",
        "The mystical atmosphere of the Himalayas.",
        "A helicopter ride over the Kedarnath Wildlife Sanctuary (optional).",
        "Staying overnight near the temple under the starry sky."
    ],
    "local_guides_available": true,
    "best_months": "May to June and September to October. Avoid monsoon (July-August) due to landslide risks.",
    "how_to_reach": "By Air: Jolly Grant Airport, Dehradun. Then road to Gaurikund. Helicopter services available from Phata/Guptkashi. By Road: Bus/Taxi to Gaurikund via Rishikesh/Rudraprayag.",
    "stay_recommendations": "GMVN Guest Houses, tent colonies, and basic lodges are available near the temple. Booking in advance is crucial during peak season.",
    "safety_tips": "Acclimatize properly to avoid altitude sickness. Carry warm clothes even in summer. Medical checkup is recommended for seniors. Avoid trekking at night.",
    "sample_itinerary": "Day 1: Drive from Rishikesh to Guptkashi/Sonprayag. Stay overnight.\nDay 2: Early morning transport to Gaurikund. Start trek (6-8 hours). Reach Kedarnath. Evening Aarti. Stay.\nDay 3: Morning Darshan. Trek down to Gaurikund. Drive back to Guptkashi.",
    "tags": [
        "Himalayas",
        "Shiva",
        "Trek",
        "Jyotirlinga",
        "Nature"
    ],
    "is_bookable": true
}