{
    "id": "madurai",
    "slug": "madurai",
    "title": "Madurai: Soul of Tamil Nadu",
    "hero_image": "madurai-hero-placeholder.jpg",
    "gallery_images": [
        "madurai-meenakshi-temple.jpg",
        "madurai-gopuram.jpg",
        "madurai-thousand-pillar-hall.jpg",
        "madurai-night-view.jpg"
    ],
    "short_description": "Marvel at the towering gopurams of the Meenakshi Amman Temple, a masterpiece of art.",
    "long_description": "Madurai is one of the oldest continuously inhabited cities in the world, often called the 'Athens of the East'. It is the cultural capital of Tamil Nadu, built in the shape of a lotus with the majestic Meenakshi Amman Temple at its center. \n\nThe temple is dedicated to Goddess Meenakshi (Parvati) and her consort Sundareswarar (Shiva). Unlike most temples where Shiva is the primary deity, here the Goddess reigns supreme. The complex is a sprawling city within a city, guarded by 14 gateway towers (gopurams) soaring up to 52 meters, covered in thousands of colorful, mythical sculptures. \n\nMadurai is a sensory overload—the fragrance of jasmine (Madurai Malli) is everywhere. The city never sleeps (Thoonga Nagaram), buzzing with markets and food stalls serving the famous Jigarthanda drink. The evening ceremony where the idol of Shiva is carried to Meenakshi's chamber in a silver palanquin is a ritual of divine romance witnessed by hundreds daily.",
    "spiritual_significance": "A major Shakti Peeth. It celebrates the divine marriage of Meenakshi and Sundareswarar (Meenakshi Tirukalyanam). The city was the seat of the Tamil Sangams (literary academies).",
    "major_temples_and_sites": [
        {
            "name": "Meenakshi Amman Temple",
            "description": "The heart of the city. Famous for its Hall of Thousand Pillars (Ayiram Kaal Mandapam) and the Golden Lotus Tank."
        },
        {
            "name": "Thirumalai Nayakkar Mahal",
            "description": "A 17th-century palace built by King Thirumalai Nayak, featuring giant pillars and a fusion of Dravidian and Islamic styles."
        },
        {
            "name": "Koodal Azhagar Temple",
            "description": "A Vishnu temple with three altars, one above the other, depicting Vishnu in sitting, standing, and reclining postures."
        },
        {
            "name": "Gandhi Memorial Museum",
            "description": "Housed in a palace, it contains the blood-stained dhoti worn by Mahatma Gandhi when he was assassinated."
        },
        {
            "name": "Vandiyur Mariamman Teppakulam",
            "description": "A huge temple tank with a mandapam in the center. The float festival here is spectacular."
        }
    ],
    "rituals_and_experiences": [
        "Darshan of Meenakshi Amman (Green Idol).",
        "Visit the Thousand Pillar Hall (Museum).",
        "Witness the Night Ceremony (Palliyarai Seva) at 9 PM.",
        "Walk through the bustling streets around the temple (Chithirai streets).",
        "Taste Madurai Idli and Jigarthanda.",
        "Buy some Madurai Jasmine."
    ],
    "highlights": [
        "The kaleidoscopic Gopurams.",
        "The musical pillars in the temple.",
        "The fervent night ceremony.",
        "The grandeur of Thirumalai Nayakkar Mahal.",
        "The vibrant street food culture."
    ],
    "local_guides_available": true,
    "best_months": "October to March. April (Chithirai Festival) is grand but hot.",
    "how_to_reach": "By Air: Madurai International Airport (IXM). By Train: Madurai Junction. By Road: Key hub in Tamil Nadu.",
    "stay_recommendations": "Luxury: Heritage Madurai, The Gateway Hotel Pasumalai. Spiritual: Madurai Adheenam. Budget: Hotels near West Perumal Maistry Street.",
    "safety_tips": "Non-Hindus are allowed everywhere except the inner sanctum. Dress modestly. No photography inside the main temple.",
    "sample_itinerary": "Day 1: Arrive. Visit Thirumalai Nayakkar Mahal. Evening visit to Meenakshi Temple (spend 3-4 hours). Watch Night Ceremony.\nDay 2: Morning Flower Market visit. Visit Gandhi Museum. Lunch (Mess food). Depart for Rameswaram or Kanyakumari.",
    "tags": [
        "Goddess",
        "Art",
        "Culture",
        "Architecture",
        "Food"
    ],
    "is_bookable": true
}