{
    "id": "palitana",
    "slug": "palitana",
    "title": "Palitana: City of Jain Temples",
    "hero_image": "palitana-hero-placeholder.jpg",
    "gallery_images": [
        "palitana-temple-cluster.jpg",
        "palitana-shatrunjaya-hill.jpg",
        "palitana-adinath.jpg",
        "palitana-sunrise.jpg"
    ],
    "short_description": "Climb Shatrunjaya hill to witness a breathtaking cluster of over 800 marble Jain temples.",
    "long_description": "Palitana in Gujarat is the world's only mountain with more than 900 temples. It is the most sacred pilgrimage site (Tirtha) for Jains. The temples are located atop the Shatrunjaya Hill ('Place of Victory against Inner Enemies'), requiring a climb of over 3,500 steps.\n\nBuilt over a span of 900 years (starting from the 11th century), the temples are carved in white marble and organized into Tuks (enclosures). The holiest is the Adishwara Temple, dedicated to the first Tirthankara, Rishabhanatha. The sight of hundreds of spires reaching for the sky, glistening in the morning sun, is ethereal. \n\nPalitana is legally the world's first vegetarian city; the sale of meat and eggs is banned. The hill is considered so sacred that no one, not even the priests, is allowed to stay overnight on the summit; the gods are left alone at dusk.",
    "spiritual_significance": "The most important Jain Tirtha. It is believed that millions of souls have attained Nirvana from this hill. Every Jain aspires to climb it at least once.",
    "major_temples_and_sites": [
        {
            "name": "Adishwara Temple",
            "description": "The main shrine dedicated to the first Tirthankara. It has intricate carvings and jewel-studded idols."
        },
        {
            "name": "Chaumukh Temple",
            "description": "The four-faced temple, the highest point on the hill."
        },
        {
            "name": "Shatrunjaya Hill",
            "description": "The hill itself is sacred. The climb offers views of the Shetrunji river."
        },
        {
            "name": "Jain Museum",
            "description": "Located at the base, displaying Jain art and history."
        },
        {
            "name": "Vallabhi",
            "description": "An ancient university town located nearby."
        }
    ],
    "rituals_and_experiences": [
        "Climb the 3,500+ steps (start at 4 AM to avoid heat).",
        "Perform Puja at Adishwara Temple.",
        "Walk in silence (Maun) if possible.",
        "See the curvature of the earth from the top.",
        "Eat 'Bhojas' (Jain food) at the dharmashalas at the base."
    ],
    "highlights": [
        "The architectural marvel of 900+ temples.",
        "The incredible cleanliness of the complex.",
        "The sunrise view from the climb.",
        "The vegetarian culture.",
        "The palanquin (Doli) ride for those who can't walk."
    ],
    "local_guides_available": true,
    "best_months": "October to February. Avoid summer. Closed during monsoon (Chaumasi).",
    "how_to_reach": "By Air: Bhavnagar Airport (50km). By Train: Palitana Station. By Road: 1 hr from Bhavnagar.",
    "stay_recommendations": "Luxury: Vijay Vilas Palace (heritage). Spiritual: Hundreds of Jain Dharmashalas (very strict rules). Budget: Hotels in Palitana town.",
    "safety_tips": "No food is allowed to be carried up the hill (only water). Leather items are prohibited. You must descend before sunset.",
    "sample_itinerary": "Day 1: Arrive Palitana. Rest early.\nDay 2: Start climb at 4:30 AM. Reach top by 6:30 AM. Darshan. Descend by 11 AM. Lunch. Depart.",
    "tags": [
        "Jainism",
        "Architecture",
        "Hills",
        "Vegetarian",
        "Peace"
    ],
    "is_bookable": true
}