{
    "id": "tirupati",
    "slug": "tirupati",
    "title": "Tirupati: The Lord of Seven Hills",
    "hero_image": "tirupati-hero-placeholder.jpg",
    "gallery_images": [
        "tirupati-temple-gold.jpg",
        "tirupati-laddoo-prasadam.jpg",
        "tirupati-hills-view.jpg",
        "tirupati-crowd.jpg"
    ],
    "short_description": "Visit one of the world's richest and most visited temples atop the sacred Tirumala hills.",
    "long_description": "Tirupati is the gateway to Tirumala, home to the ancient temple of Lord Venkateswara (Balaji), a form of Vishnu. Perched atop the seventh peak of the Seshachalam Hills, Tirumala is often called 'Bhuloka Vaikuntham' (Abode of Vishnu on Earth). It is a phenomenon of organization and devotion, handling nearly 50,000 to 100,000 pilgrims daily, making it arguably the most visited religious site globally.\n\nThe journey typically involves a walk up the steps from Alipiri (a 9km trek), considered an act of surrender. The air resonates with the chant 'Govinda! Govinda!' Devotees come here to drop their ego—symbolized by the practice of 'Mundan' (tonsuring the head), where kings and commoners alike shave their hair as an offering. \n\nThe idol of Lord Venkateswara is awe-inspiring, standing tall, adorned with immense jewels, yet radiating a powerful calm. The temple complex is a masterpiece of Dravidian architecture with its gold-plated dome (Ananda Nilayam). The prasadam, the 'Tirupati Laddu', is legendary and holds a GI tag.",
    "spiritual_significance": "One of the 108 Divya Desams. It is believed that Lord Vishnu resides here in the Kali Yuga to guide and bless devotees. Tonsuring (hair offering) is a key ritual signifying the shedding of vanity.",
    "major_temples_and_sites": [
        {
            "name": "Sri Venkateswara Temple",
            "description": "The main shrine on Tirumala hills, famous for the gold-plated gopuram and the powerful deity of Lord Balaji."
        },
        {
            "name": "Sri Padmavathi Ammavari Temple",
            "description": "Located in Tiruchanur (downhill). Tradition dictates visiting the consort of the Lord, Goddess Padmavathi, before visiting Tirumala."
        },
        {
            "name": "Kapila Theertham",
            "description": "A temple dedicated to Lord Shiva at the base of a waterfall in Tirupati town."
        },
        {
            "name": "Silathoranam",
            "description": "A rare natural rock arch formation near the temple, believed to be geological marvel and associated with divine legends."
        },
        {
            "name": "Akash Ganga",
            "description": "A perennial waterfall where water is sourced for the Lord's daily abhishekam."
        }
    ],
    "rituals_and_experiences": [
        "Perform Angapradakshinam (rolling on the floor around the temple).",
        "Offer hair (Mundan) at the Kalyanakatta facility.",
        "Walk up the 3,550 steps from Alipiri to Tirumala.",
        "Participate in the Suprabhatam Seva (waking the Lord at dawn).",
        "Taste the world-famous Tirupati Laddu Prasadam."
    ],
    "highlights": [
        "The 9km trek on the covered footpath.",
        "The sight of the golden 'Ananda Nilayam' dome.",
        "The mesmerizing idol of Lord Venkateswara.",
        "The sheer scale and efficiency of the queue complex (Vaikuntam).",
        "The scenic beauty of the Seshachalam hills."
    ],
    "local_guides_available": true,
    "best_months": "September to February. Avoid summer (May/June) due to heat. Brahmotsavam (Sept/Oct) is huge.",
    "how_to_reach": "By Air: Tirupati Airport (TIR). By Train: Tirupati Main (TPTY). By Road: Well connected to Chennai (130km) and Bangalore (250km).",
    "stay_recommendations": "Luxury: Fortune Select Grand Ridge. Spiritual: TTD Guest Houses (Nandakam, Vishnu Niwas) on the hill (book months in advance). Budget: Dharamshalas in Tirupati town.",
    "safety_tips": "Queues can last 10-20 hours; be mentally prepared. Carry water and snacks. Dress code is strictly traditional (Dhoti/Saree/Kurta). No jeans/t-shirts inside.",
    "sample_itinerary": "Day 1: Arrive. Visit Padmavathi Temple. Start trek from Alipiri (3-4 hours) or take bus/taxi uphill. Check into room. Tonsure head.\nDay 2: Join the Darshan queue (early morning). Visit temple. Collect Laddu. Visit Silathoranam. Return downhill.",
    "tags": [
        "Vishnu",
        "South India",
        "Richest Temple",
        "Culture",
        "Hills"
    ],
    "is_bookable": true
}